#Область ПроцедурыИФункцииПоРаботеСБиллингомПоРасписанию

Функция ПолучитьИдентификаторыПриложенийДляОстановки(ТокенПодключения) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентовbs_СписокСервисов.Сервис.Код КАК ИдентификаторПриложения
		|ИЗ
		|	РегистрСведений.BS_ЗарегистрированныеОбъектыБиллинга.СрезПоследних(&Период, ДатаОстановки <= &Период) КАК
		|		BS_ЗарегистрированныеОбъектыБиллингаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.bs_СписокСервисов КАК ДоговорыКонтрагентовbs_СписокСервисов
		|		ПО BS_ЗарегистрированныеОбъектыБиллингаСрезПоследних.Объект.Договор = ДоговорыКонтрагентовbs_СписокСервисов.Ссылка";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		МассивИдентификаторов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ИдентификаторПриложения");
	Иначе
		МассивИдентификаторов = Новый Массив;
	КонецЕсли;
	
	Возврат МассивИдентификаторов;
	
КонецФункции

#КонецОбласти