Процедура ЗарегистрироватьОбъект(Источник) Экспорт
	
	Объект = Источник.Ссылка;
	
	Если ЗначениеЗаполнено(Объект) Тогда
		
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.BS_ЗарегистрированныеОбъектыБиллинга.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период					= Объект.Дата;
	НоваяЗапись.Объект 					= Объект;
	НоваяЗапись.СрокОплатыПокупателя 	= Объект.Договор.СрокОплатыПокупателя;
	НоваяЗапись.ДатаОстановки			= Объект.Дата + 86400 * НоваяЗапись.СрокОплатыПокупателя;	
	
	НаборЗаписей.Записать();
		
	УстановитьПривилегированныйРежим(Ложь);
	
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалениеЗарегистрированногоОбъекта(Объект) Экспорт
	
	НаборЗаписей = РегистрыСведений.BS_ЗарегистрированныеОбъектыБиллинга.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Записать();             
	
КонецПроцедуры
