Процедура ЗарегистрироватьОбъект(Источник) Экспорт
	
	Объект = Источник.Ссылка;
	
	Если ЗначениеЗаполнено(Объект) Тогда
		
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.BS_ЗарегистрированныеОбъектыБиллинга.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период					= Объект.Дата;
	НоваяЗапись.Объект 					= Объект;
	НоваяЗапись.СрокОплатыПокупателя 	= Объект.Договор.СрокОплатыПокупателя;
	НоваяЗапись.ДатаОстановки			= Объект.Дата + 86400 * НоваяЗапись.СрокОплатыПокупателя;	
	
	НаборЗаписей.Записать();
		
	УстановитьПривилегированныйРежим(Ложь);
	
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалениеЗарегистрированногоОбъекта(Объект) Экспорт
	
	НаборЗаписей = РегистрыСведений.BS_ЗарегистрированныеОбъектыБиллинга.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Записать();             
	
	Договор = Объект.Договор;
	НастройкаБиллинга = Договор.bs_СписокСервисов[0].Сервис.НастройкаБиллинга;
	Токен = bs_РаботаСAPIВызовСервера.ПолучитьТокен(НастройкаБиллинга);
	Для каждого Строка Из Договор.bs_СписокСервисов Цикл
		Сервис = Строка.Сервис;
		Метод = СтрШаблон(BS_ОбщегоНазначенияВызовСервераПовтИсп.МетодЗапускаПриложения(),
							Сервис.Код);
		bs_РаботаСAPIВызовСервера.ВызватьМетодAPI(Метод, Токен,
										 BS_ОбщегоНазначенияВызовСервераПовтИсп.HTTPМетоды().POST);	
	КонецЦикла;
	
КонецПроцедуры
