#Область Orders
Функция ПолучитьСписокСервисов(Token=0) Экспорт

АдресРесурса = "/partner-api/v2/orders/services";
Возврат ОтправитьPostЗапросКAPI(Token, АдресРесурса);

КонецФункции
#КонецОбласти

#Область Прочее
Функция ОтправитьPostЗапросКAPI(Token, АдресРесурса)

ЗапросКAPI = Новый HTTPЗапрос;
ЗапросКAPI.Заголовки.Вставить("accept", "application/json");
ЗапросКAPI.Заголовки.Вставить("Authorization", "Bearer "+Token);
ЗапросКAPI.АдресРесурса = АдресРесурса;

Соединение1 = Новый HTTPСоединение("service-api.1capp.com",,,,Новый ИнтернетПрокси,,Новый ЗащищенноеСоединениеOpenSSL);
ОтветHTTP = Соединение1.ОтправитьДляОбработки(ЗапросКAPI);

Возврат ОтветHTTP;

КонецФункции
#КонецОбласти