
&НаКлиенте
Процедура bs_СохранитьТокен(Команда)
	bs_СохранитьТокенНаСервере();
КонецПроцедуры

&НаСервере
Процедура bs_СохранитьТокенНаСервере()
	Константы.bs_token.Установить(Объект.token);
КонецПроцедуры

&НаКлиенте
Процедура bs_ЗаполнитьСправочникСервисов(Команда)

	Результат = bs_работаСAPIКлиент.ВызватьМетодAPIGET("/orders/services");
	
	bs_ОбработкаРезультатаВызовСервера.ОбработатьСервисы(Результат);

КонецПроцедуры

&НаКлиенте
Процедура bs_сопоставитьКлиентов(Команда)
	Результат = bs_работаСAPIКлиент.ВызватьМетодAPIGET("/customers");
	
	ОбработатьРезультатНаСервере(Результат)
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатНаСервере(Результат)
	Для Каждого Строка из Результат Цикл
		
		НайденныйКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", Строка.inn);
		
			НовыйКонтрагент 			= Объект.Контргаенты.Добавить();
			НовыйКонтрагент.Контрагент 	= НайденныйКонтрагент.Ссылка;
			НовыйКонтрагент.id 			= Строка.id;	
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура bs_ЗаписатьID(Команда)
	bs_ЗаписатьIDНаСервере();
КонецПроцедуры

&НаСервере
Процедура bs_ЗаписатьIDНаСервере()
		Для Каждого Строка из Объект.Контргаенты Цикл
			КонтрагентОбъект = Строка.Контрагент.ПолучитьОбъект();
			КонтрагентОбъект.bs_IDГРМ = Строка.id;
			КонтрагентОбъект.Записать();
		КонецЦикла;
КонецПроцедуры


