
&Перед("ВыполнитьОбработкуПоРегламентномуЗаданию")
Процедура BS_ВыполнитьОбработкуПоРегламентномуЗаданию(ВнешняяОбработка, ИдентификаторКоманды) Экспорт
	
	Если BS_ОбщегоНазначенияВызовСервераПовтИсп.БазаИспользуетсяВМоделиСервиса() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураРеглЗаданий = BS_ОбщегоНазначенияВызовСервера.ПолучитьИспользуемыеРеглЗадания();	
	
	Если ТипЗнч(ВнешняяОбработка) = Тип("Строка") И ВнешняяОбработка = СтруктураРеглЗаданий.Биллинг Тогда
		BS_БиллингКлиентСервер.ВыполнитьБиллинг(ИдентификаторКоманды);
	КонецЕсли;
	
КонецПроцедуры
