#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыОбработчикиСобытий

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
УстановитьПривилегированныйРежим(Истина);	//Для возможности удаления расписания при удалении настройки

	РегламентныеЗаданияСервер.УдалитьЗадание(ИдентификаторРегламентногоЗадания);
	ИдентификаторРегламентногоЗадания = Неопределено;	
УстановитьПривилегированныйРежим(Ложь);	
	
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

#КонецОбласти

#КонецЕсли