
Процедура ОбработатьСервисы(Результат) Экспорт
	Для Каждого Элемент из Результат Цикл
	Если не ЗначениеЗаполнено(Справочники.BS_СписокСервисов.НайтиПоКоду(Элемент.id)) Тогда
	НовыйСервис = Справочники.BS_СписокСервисов.СоздатьЭлемент();
	НовыйСервис.Код = Элемент.id;
	НовыйСервис.Наименование = Элемент.name;
	Для Каждого kit из Элемент.kits цикл
		Новыйkit = НовыйСервис.bs_kits.Добавить();
		Новыйkit.bs_id = kit.id;
		Новыйkit.bs_Вариант = kit.name;
	КонецЦикла;
	НовыйСервис.Записать();
	КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработатьСервисыКонтрагента(НастройкаБиллинга, Результат) Экспорт
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	BS_КонтрагнетыОблачногоСервиса.Контрагент КАК Контрагент,
			|	BS_КонтрагнетыОблачногоСервиса.Идентификатор КАК Идентификатор
			|ИЗ
			|	РегистрСведений.BS_КонтрагнетыОблачногоСервиса КАК BS_КонтрагнетыОблачногоСервиса
			|ГДЕ
			|	НЕ BS_КонтрагнетыОблачногоСервиса.Контрагент ЕСТЬ NULL
			|	И BS_КонтрагнетыОблачногоСервиса.НастройкаБиллинга = &НастройкаБиллинга";
		
		Запрос.УстановитьПараметр("НастройкаБиллинга", НастройкаБиллинга);
		
		ТЗКонтрагентов = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Строка из Результат Цикл
			НайденныйСервис = Справочники.bs_СервисыКонтрагента.НайтиПоКоду(Строка.id);
			Если НЕ ЗначениеЗаполнено(НайденныйСервис) Тогда
				СтрокаТЗКонтрагентов = ТЗКонтрагентов.Найти(Строка.customerId, "Идентификатор");
				Если СтрокаТЗКонтрагентов <> Неопределено Тогда
					НовыйСервис = Справочники.bs_СервисыКонтрагента.СоздатьЭлемент();
					НовыйСервис.Владелец = СтрокаТЗКонтрагентов.Контрагент;
					НовыйСервис.Код = Строка.id;
					НовыйСервис.НастройкаБиллинга = НастройкаБиллинга;
					НовыйСервис.Наименование = Строка.name;
					НовыйСервис.Записать();
				КонецЕсли;
			Иначе
				Сервис = НайденныйСервис.ПолучитьОбъект();
				Сервис.НастройкаБиллинга = НастройкаБиллинга;
				Сервис.Записать();
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;
КонецПроцедуры



