
Процедура ОбработатьСервисы(Результат) Экспорт
	Для Каждого Элемент из Результат Цикл
	Если не ЗначениеЗаполнено(Справочники.BS_СписокСервисов.НайтиПоКоду(Элемент.id)) Тогда
	НовыйСервис = Справочники.BS_СписокСервисов.СоздатьЭлемент();
	НовыйСервис.Код = Элемент.id;
	НовыйСервис.Наименование = Элемент.name;
	Для Каждого kit из Элемент.kits цикл
		Новыйkit = НовыйСервис.bs_kits.Добавить();
		Новыйkit.bs_id = kit.id;
		Новыйkit.bs_Вариант = kit.name;
	КонецЦикла;
	НовыйСервис.Записать();
	КонецЕсли;
	КонецЦикла;
КонецПроцедуры



