
&НаКлиенте
Процедура Расш1_bs_ЗаполнитьСервисыПоIDВместо(Команда)
	
	ID = Объект.bs_IDГРМ;
	
	Если НЕ ЗначениеЗаполнено(ID) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Поле ID не заполнено";
		Сообщение.Поле = "Объект.bs_IDГРМ";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Результат = bs_работаСAPIКлиент.ВызватьМетодAPIGET("/customers/"+ID+"/applications");
	
	ОбработатьРезультатНаСервере(Результат)
	
КонецПроцедуры


&НаСервере
Процедура ОбработатьРезультатНаСервере(Результат)
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
	
		Для Каждого Строка из Результат Цикл
			НовыйСервис = Справочники.bs_СервисыКонтрагента.СоздатьЭлемент();
			НовыйСервис.Владелец = Объект.Ссылка;
			НовыйСервис.Код = Строка.id;
			НовыйСервис.Наименование = Строка.name;
			НовыйСервис.Записать();
		КонецЦикла;
		Модифицированность = Истина;
	Иначе
		
		Объект.bs_IDГРМ = Неопределено;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Контрагент по ID: %1 не найден", Объект.bs_IDГРМ);
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры
