#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ОбработкаПроведения")
Процедура BS_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Договор.ЭтоДоговорОбслуживания Тогда
		BS_РегистрацияОбъектовБиллингаВызовСервера.ЗарегистрироватьОбъект(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура BS_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		ИЛИ ЭтотОбъект.ПометкаУдаления Тогда
			
		BS_РегистрацияОбъектовБиллингаВызовСервера.УдалениеЗарегистрированногоОбъекта(ЭтотОбъект.Ссылка)
		
	КонецЕсли;

КонецПроцедуры

#КонецЕсли